nexts-corp/IMS/HEMS/STM32F0-ReadSenser_ch1/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"
#include "stm32f0xx_hal.h"
#include "main.h"
#include "print_debug.h"
#include "xbee.h"
#include "xbeehandler.h"
#include "protocol.h"
#include "handler.h"
#include <math.h>
//#include "stm32f0xx_it.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;


data_t data_gw_xbee;
recv_uart_t recv_uart_1,recv_uart_2;
/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM3_Init(void);

extern int FlagReadCurrent;
extern int FlagReadVolt ;
extern int countSampling;
extern int FlagSendData;
extern int number; 



/******* Global *************/
	int status_sw = 0;
	int event = 0;
	uint32_t timeStamp = 0;
	char stat_on[]  = {0x01, 0x00, 0x00, 0x00};
	char stat_off[]  = {0x00, 0x00, 0x00, 0x00};
	int8_t ret = 0;
	int joinState = 1;
	int ret_SN = 0;
	uint8_t specData[13] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0xFF, 0xFF, 0xFF, 0xFF};   // Specific Stucture of Join Req packet	
  uint8_t statusRepParam[13]; // Parameter of status report
  DATASET data[4];
	float total     = 0.0;
	float avg       = 2500;
	float value     = 0.0;
	float Viout     = 0.0; 
	float Vdif      = 0.0;
	float Vsq_avg   = 0.0;
	float volt      = 0.0;
	float amp       = 0.0;
	float power     = 0.0;
	float whour     = 0.0;
	float Vsum      = 0.0;
	float Isum      = 0.0;
	float Psum      = 0.0;
	float WHsum     = 0.0;
	float Vavg      = 0.0;
	float Iavg      = 0.0;
	float Pavg      = 0.0; 
	
	int ChckADCMax =0;

	uint16_t adcValue       = 0; 
	//uint16_t number         = 0;
	
	uint8_t SWITCH;
	float CURRENT_VOLT;
	float CURRENT_AMP;
/******* Global *************/

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_SPI1_Init();
  MX_TIM3_Init();
	print_init(&huart1);
	__HAL_UART_ENABLE_IT(&huart1,UART_IT_RXNE);
	__HAL_UART_ENABLE_IT(&huart2,UART_IT_RXNE);
	
	ChipSelect(ALL,1);
	
	 //HAL_GPIO_WritePin(GPIOC, GPIO_PIN_3, GPIO_PIN_SET);

  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

	xbee_flush();
	print_debug(0,"Nathapoong\r\n");
	while(joinState != 5)
	{
		xbee_flush();
		switch(joinState) {
			case 1:
					print_debug(0,"PAIRING OPERATION> Start..\r\n");
					print_debug(0,"PAIRING OPERATION> Check Serial Number..\r\n");
					xbee_readSerialNumber();
					ret_SN = xbee_getserial();
					if(ret_SN == 1){
						memcpy(&specData[0], &SENDER_ADDRESS[0], 8);
						joinState = 2;
					}
					break;
			case 2:
				if(_xbee_chkAsso_res != 1){
					print_debug(0,"PAIRING OPERATION> Waiting Association..\r\n");
					xbee_checkAssociation();
					HAL_Delay(1000);
					xbee_receivePacket();
				}
				else {
					if(_xbee_join !=1){
						print_debug(0,"PAIRING OPERATION> Xbee Association..\r\n");
						xbee_checkAssociation();
					}
					else {
						print_debug(0,"PAIRING OPERATION> Xbee Joined..\r\n");
						joinState = 3;
					}
					
				}
				break;
			case 3:
						INT_sendNetworkMaintenanceCmd(HEARTBEAT, NULL, 0, 0);
						HAL_Delay(1000);
						xbee_receivePacket();
						if(_hb_res){
							print_debug(0,"PAIRING OPERATION> Xbee Heartbeat OK ..\r\n");
							HAL_GPIO_WritePin(GPIOC,GPIO_PIN_9,GPIO_PIN_SET);
							joinState = 4;
						}
						break;		
				case 4:
						INT_sendNetworkMaintenanceCmd(JOINREQ,(char*)specData,sizeof(specData),0);
						HAL_Delay(1000);
						xbee_receivePacket();
						if(_joinreq_res){
							print_debug(0,"PAIRING OPERATION> Xbee Join OK ..\r\n");
							HAL_GPIO_WritePin(GPIOC,GPIO_PIN_8,GPIO_PIN_SET);
							joinState = 5;
							//manag_sw();
							event = 1;
						}
						break;
		}		
	}
	
	
	HAL_TIM_Base_Init(&htim3);
	HAL_TIM_Base_Start_IT(&htim3);
	event = 1;
	while(event == 1)
	{
		/*---------- ADC0 Sampling (AC Current Sensor) every 1 ms. ----------*/
		if(FlagReadCurrent)
		{
			ReadCurrent();
		}
		
		/*---------- ADC1 Sampling (AC Voltage Sensor) every 1s. ----------*/
		if(FlagReadVolt)
		{
			ReadVoltage();
		}
		/*---------- SendData every 10s. ----------*/
		if(FlagSendData)
		{
			HAL_GPIO_TogglePin(GPIOC,GPIO_PIN_9);
		
			print_debug(0,"Mode DataReport \r\n");
			sendDataReport();  					/*****sendDataReport*******/
			HAL_Delay(1000);
			xbee_receivePacket();

			FlagSendData=0;
			number=0;
		
