nexts-corp/IMS/HEMS/STM32F0-ReadSenser_ch1/Src/main.c
		}
//			print_debug(0,"Mode Event\r\n");
//			if(status_sw == TURN_ON){
//				print_debug(0,"Mode DataReport \r\n");
//				sendDataReport();  					/*****sendDataReport*******/
//				HAL_Delay(1000);
//				xbee_receivePacket();
//			}
//			print_debug(0,"Mode StatusReport \r\n");
//				sendStatusReport();						/*****sendStatusReport*******/
//				HAL_Delay(1000);
//				xbee_receivePacket();
					//while(1);
	}
	
		
}
void sendDataReport(){
				Vavg = Vsum/number;      // Voltage
				Iavg = Isum/number;      // Current
				Pavg = Psum/number;      // Power 
						
				CURRENT_VOLT = Vavg;
				CURRENT_AMP = Iavg; 

//				Vavg = 220.0f;
//				Iavg = 3.0f;
//				Pavg = Vavg *Iavg;
//				WHsum = 100;	
	
				print_debug(0,"\r\n======================================================\r\n");
				print_debug(0,"Vsum = %0.4f  ", Vsum); print_debug(0,"Isum = %0.4f  ", Isum); print_debug(0,"Psum = %0.4f\r\n", Psum);
				print_debug(0,"Vavg = %0.4f   ", Vavg); print_debug(0,"Iavg = %0.4f   ", Iavg); print_debug(0,"Pavg = %0.4f\r\n", Pavg);
				print_debug(0,"Watt-Hour Sum = %0.4f\r\n", WHsum);
				print_debug(0,"Number Sampling = %d\r\n", number);
				print_debug(0,"======================================================\r\n\r\n");
				
				data[0].dataID = 0x01;
				data[0].dataType = VOLT;
				data[0].value = Vavg;
				data[1].dataID = 0x01;
				data[1].dataType = AMP;
				data[1].value = Iavg*1000.0;    // mA
				data[2].dataID = 0x01;
				data[2].dataType = PWR;
				data[2].value = Pavg;
				data[3].dataID = 0x01;
				data[3].dataType = KWH;
				data[3].value = WHsum;
						
				INT_sendDataReportCmd(timeStamp, 0x00, 0x04, data, TIMEOUT);
				
				Vsum = 0;
				Isum = 0;
				Psum = 0;
				//WHsum = 0;     
			
}
void sendStatusReport(void){
	/*---------- STATUS_REPORT_CMD ----------*/ 
			statusRepParam[0] = SWITCH;
			statusRepParam[1] = 0x00;
			statusRepParam[2] = 0x00;
			statusRepParam[3] = 0x00;
			statusRepParam[4] = 0x00;                    
			memcpy(&statusRepParam[5], &CURRENT_VOLT, 4);          
			memcpy(&statusRepParam[9], &CURRENT_AMP, 4);      
	
			INT_sendStatusReportCmd(timeStamp, 0x20, (char*)statusRepParam, 13, TIMEOUT);   
			//TIMER_setTimer(&statusRep_retrytime, 60);
}
void manag_sw(void){
		print_debug(0,"In Switch on/off\r\n");
		switch(status_sw) {
			case 0:
					print_debug(0,"SWITCH ON!\r\n");           
					INT_sendEventReportCmd(timeStamp, 0x00, 0xA0, stat_on, TIMEOUT);
					HAL_Delay(1000);
					xbee_receivePacket();
					status_sw = TURN_ON;
					break;
			case 1:
					print_debug(0,"SWITCH OFF!\r\n");           
					INT_sendEventReportCmd(timeStamp, 0x00, 0xA0, stat_off, TIMEOUT);
					HAL_Delay(1000);
					xbee_receivePacket();
					status_sw = TURN_OFF;
					break;
		}
}

// Get ADC values
// Returns 0..4095
int16_t getADC(unsigned short CS,unsigned short channel) 
{   
  int16_t ReadADC=0;
	uint8_t BffReadADC[4];
	uint8_t a[1];
	uint8_t b[]={0x06};
	uint8_t start = (uint8_t)0x06;
	uint8_t ch = (uint8_t)0x00;
	channel=channel*4;
	ch = (uint8_t)channel;
	ChipSelect(CS,0);
	
	HAL_SPI_Transmit(&hspi1,&start,1,10);
	HAL_SPI_Transmit(&hspi1,&ch,1,10);
	HAL_SPI_Receive(&hspi1,&BffReadADC[0],2,10);
	ReadADC = (BffReadADC[0] & 0x0F);               // Get first 8 bits of ADC value
  ReadADC = ReadADC << 8;                                // Shift ADC value by 8
	HAL_SPI_Transmit(&hspi1,&ch,1,10);
	HAL_SPI_Receive(&hspi1,&BffReadADC[2],2,10);
	ReadADC |= ((BffReadADC[1] << 4) | BffReadADC[2]) & 0x00FF;
	
	ChipSelect(CS,1);

  return ReadADC ;                                    // Returns 12-bit ADC value
}

void ChipSelect(unsigned short CS,unsigned short status)
{

	switch(status)// PIN CS LOW
	{
		case 0:
			switch(CS)// PIN CS LOW
			{
				case 1:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0,0); //CS1
					break;
				case 2:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1,0); //CS2
					break;
				case 3:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4,0); //CS3
					break;
				case 4:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8,0); //CS4
					break;
				case 5:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11,0); //CS5
					break;
				case 6:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12,0); //CS6
					break;
				case 7:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15,0); //CS7
					break;
				case 8:
					HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10,0); //CS8
					break;
				case 9:
					HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11,0); //CS9
					break;
				case 10:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,0); //CS10
					break;
				case 11:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,0); //CS11
					break;
				case 12:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10,0); //CS12
					break;
				case 13:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11,0); //CS13
					break;
				case 14:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12,0); //CS14
					break;
				case 15:
					HAL_GPIO_WritePin(GPIOF, GPIO_PIN_4,0); //CS15
					break;
				case 16:
					HAL_GPIO_WritePin(GPIOF, GPIO_PIN_5,0); //CS16
					break;
				case 17:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0,0); //CS1
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1,0); //CS2
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4,0); //CS3
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8,0); //CS4
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11,0); //CS5
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12,0); //CS6
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15,0); //CS7
					HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10,0); //CS8
					HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11,0); //CS9
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,0); //CS10
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,0); //CS11
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10,0); //CS12
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11,0); //CS13
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12,0); //CS14
					HAL_GPIO_WritePin(GPIOF, GPIO_PIN_4,0); //CS15
					HAL_GPIO_WritePin(GPIOF, GPIO_PIN_5,0); //CS16
					break;
				default :
					break;
			}
			break;
		case 1:
			switch(CS)// PIN CS LOW
			{
				case 1:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0,1); //CS1
					break;
				case 2:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1,1); //CS2
					break;
				case 3:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4,1); //CS3
					break;
				case 4:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8,1); //CS4
					break;
				case 5:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11,1); //CS5
					break;
				case 6:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12,1); //CS6
					break;
				case 7:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15,1); //CS7
					break;
				case 8:
					HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10,1); //CS8
					break;
				case 9:
					HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11,1); //CS9
					break;
				case 10:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,1); //CS10
					break;
				case 11:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,1); //CS11
					break;
				case 12:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10,1); //CS12
					break;
				case 13:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11,1); //CS13
					break;
				case 14:
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12,1); //CS14
					break;
				case 15:
					HAL_GPIO_WritePin(GPIOF, GPIO_PIN_4,1); //CS15
					break;
				case 16:
					HAL_GPIO_WritePin(GPIOF, GPIO_PIN_5,1); //CS16
					break;
				case 17:
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0,1); //CS1
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1,1); //CS2
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4,1); //CS3
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8,1); //CS4
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11,1); //CS5
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12,1); //CS6
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15,1); //CS7
					HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10,1); //CS8
					HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11,1); //CS9
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,1); //CS10
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,1); //CS11
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10,1); //CS12
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11,1); //CS13
					HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12,1); //CS14
					HAL_GPIO_WritePin(GPIOF, GPIO_PIN_4,1); //CS15
					HAL_GPIO_WritePin(GPIOF, GPIO_PIN_5,1); //CS16
					break;
				default :
					break;
			}
			break;
		default :
			break;
	}
	
