nexts-corp/IMS/HEMS/STM32F0-ReadSenser_ch1/Src/main.c
}

void ReadCurrent(void)
{
	
	adcValue = getADC(1,0); 
	//print_debug(0,"ADC = %d\r\n",adcValue);
	value = ((float)adcValue) * (5000.0/ 4095.0);
	//print_debug(0,"value = %f\r\n",value);
	avg = (499.0*avg + value) / 500.0;
	//print_debug(0,"avg = %f\r\n",avg);	

	if(value > avg) {
			Vdif = value - avg;
			total += (Vdif*Vdif);              
	}else if(value < avg) { 
			Vdif = avg - value;
			total += (Vdif*Vdif);
	}
	
	countSampling++;
	FlagReadCurrent=0;
}
void ReadVoltage(void)
{
	HAL_GPIO_TogglePin(GPIOC,GPIO_PIN_8);
	//print_debug(0,"--------------------------------------------------\r\n");
	 /*---------- Voltage ----------*/
	adcValue = getADC(1,1);
	//print_debug(0,"ADC = %d\r\n",adcValue);
	volt = (((adcValue*5.0)/4095.0)/0.01); 
	if(volt < 223.0) { 
			volt += 9.0;
	}else if(volt > 233.0) {
			volt -= 4.0;
	}
	//print_debug(0,"Volt = %f\r\n",volt);
	Vsum += volt;
							
	/*---------- Current ----------*/

	//print_debug(0,"total = %f\r\n",total);	
	Vsq_avg = total / ((float)countSampling);
	//print_debug(0,"Vsq_avg = %f\r\n",Vsq_avg);
	//print_debug(0,"countSampling = %d\r\n",countSampling);
	
	Viout = sqrt(Vsq_avg);
	Viout = Viout - Offset;
	amp = Viout / 28;                  // ACS709 +-30 Amp.
	//print_debug(0,"Viout = %f\r\n",Viout);
			 
	/* Adjust Current to 0 */
	if(amp < 0.025) {
			amp = 0.0;                                            
	} 
			
	total = 0.0;
	
	Isum += amp;
	//print_debug(0,"amp = %f\r\n",amp);	
	
	/*---------- Power ----------*/
	power = volt*amp;
	//print_debug(0,"Power = %f\r\n",power);	
	Psum += power;
							
	/*----------  Watt-hour ----------*/
	whour = power*(0.5/3600.0);
	//print_debug(0,"Watt-Hour = %f\r\n",whour);
	WHsum += whour;
	
	
	//print_debug(0,"--------------------------------------------------\r\n");
	number++;  
	countSampling = 0;
	FlagReadVolt=0;
}

void nx_delay_us(uint32_t us)
{
		volatile uint32_t counter = 7 *us;
		while(counter--);
}
/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL12;
  RCC_OscInitStruct.PLL.PREDIV = RCC_PREDIV_DIV1;
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1);

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK1;
  HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* SPI1 init function */
void MX_SPI1_Init(void)
{

  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize = SPI_DATASIZE_4BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_64;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 7;
  hspi1.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  hspi1.Init.NSSPMode = SPI_NSS_PULSE_ENABLE;
  HAL_SPI_Init(&hspi1);

}

/* TIM3 init function */
void MX_TIM3_Init(void)
{

  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim3.Instance = TIM3;
  //htim3.Init.Prescaler = 2048000;
	//htim3.Init.Prescaler = 15625;
	//htim3.Init.Prescaler = 31250;
	//htim3.Init.Prescaler = 93750;
	//htim3.Init.Prescaler = 23437;
	htim3.Init.Prescaler = 48000;
  htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim3.Init.Period = 1;
  htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_Base_Init(&htim3);

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  HAL_TIM_ConfigClockSource(&htim3, &sClockSourceConfig);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig);

}

/* USART1 init function */
void MX_USART1_UART_Init(void)
{

  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  HAL_UART_Init(&huart1);

}

/* USART2 init function */
void MX_USART2_UART_Init(void)
{

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  HAL_UART_Init(&huart2);

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

